const Agreement = () => {
  return (
    <div style={{ lineHeight: '32px', padding: 40}}>
      <h1 style={{ textAlign: 'center'}}>盈余平台服务协议</h1>
      <p>欢迎使用盈余平台！</p>
      <p>为了使用盈余平台服务（以下简称“本服务”），你应当阅读并遵守《盈余平台服务协议》 （以下简称“本协议”）以及与此相关的专项规则等。</p>
      <p>除非你已阅读并接受本协议所有条款，否则你无权使用本服务。你对本服务的登录、查看、发布信息等行为即视为你已阅读并同意本协议的约束。你有违反本协议的任何行为时，盈余有权依照违反情况，随时单方限制、中止或终止向你提供本服务，并有权追究你的相关责任。</p>
      <p>本协议具体内容如下：</p>
      <p>一、用户应遵守当地法律法规及本协议的约定，不得利用本平台进行任何违法违规行为；</p>
      <p>二、你用以参与本服务的账号由你独立维护、运营并独立承担全部责任。盈余不会、也不可能参与该账号的运营等独立活动；</p>
      <p>三、盈余不对你在本服务中相关数据的删除或储存失败和数据丢失负责；</p>
    </div>
  )
}

export default Agreement
